; domain
(define (domain zenotravel)
	(:requirements :typing :negative-preconditions)
	(:types
		Time - Object
		City - Object
		Aircraft - Thing
		Person - Thing
		Thing - Object
		FLevel - Object
	)
	(:predicates
		(at ?arg0 - Thing ?arg1 - City)
		(in ?arg0 - Person ?arg1 - Aircraft)
		(next ?arg0 - FLevel ?arg1 - FLevel)
		(max ?arg0 - FLevel)
        (min ?arg0 - FLevel)
        (not-min ?arg0 - FLevel)
		(fuel-level ?arg0 - Aircraft ?arg1 - FLevel)
	)
	(:action board
		:parameters (?p - Person ?a - Aircraft ?c - City)
		:precondition
			(and
				(at ?p ?c)
                (at ?a ?c)
			)
		:effect
			(and
				(not (at ?p ?c))
				(in ?p ?a)
			)
	)

	(:action debark
		:parameters (?p - Person ?a - Aircraft ?c - City)
		:precondition
			(and
				(in ?p ?a)
                (at ?a ?c)
			)
		:effect
			(and
				(not (in ?p ?a))
				(at ?p ?c)
			)
	)

	(:action refuel
		:parameters (?a - Aircraft ?l - FLevel ?l1 - FLevel)
		:precondition
			(and
				(fuel-level ?a ?l)
			)
		:effect
			(and
				(not (fuel-level ?a ?l))
				(fuel-level ?a ?l1)
			)
	)

	(:action fly
		:parameters (?a - Aircraft ?c1 - City ?c2 - City ?l1 - FLevel ?l2 - FLevel)
		:precondition
			(and
				(at ?a ?c1)
				(fuel-level ?a ?l1)
                (next ?l2 ?l1)
			)
		:effect
			(and
				(not (at ?a ?c1))
				(at ?a ?c2)
				(not (fuel-level ?a ?l1))
				(fuel-level ?a ?l2)
			)
	)
)

; problem
(define (problem p1)
(:domain zenotravel)
(:objects
 f0 f1 f2 - FLevel
 a1 a2 a3 - Aircraft
 c1 c2 c3 - City
 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 p17 p18 - Person
)
(:init
(min f0) (max f2)
(next f0 f1)
(not-min f1)
(next f1 f2)
(not-min f2)
(fuel-level a1 f2) (at a1 c2)
(fuel-level a2 f2) (at a2 c1)
(fuel-level a3 f2) (at a3 c1)
(at p1 c1)
(at p2 c2)
(at p3 c3)
(at p4 c1)
(at p5 c1)
(at p6 c1)
(at p7 c3)
(at p8 c1)
(at p9 c1)
(at p10 c2)
(at p11 c1)
(at p12 c2)
(at p13 c3)
(at p14 c2)
(at p15 c2)
(at p16 c3)
(at p17 c2)
(at p18 c1)
)
(:goal (and
(at a1 c2)
(at a2 c1)
(at a3 c1)
(at p1 c2)
(at p2 c2)
(at p3 c1)
(at p4 c3)
(at p5 c1)
(at p6 c2)
(at p7 c2)
(at p8 c3)
(at p9 c1)
(at p10 c2)
(at p11 c3)
(at p12 c1)
(at p13 c1)
(at p14 c1)
(at p15 c3)
(at p16 c2)
(at p17 c1)
(at p18 c2)
))
)

; plan
1. (board p1 a3 c1)
   deleted: (at p1 c1)
   added: (in p1 a3)
   goals met: 7 of 21
2. (fly a3 c1 c2 f2 f1)
   deleted: (at a3 c1) (fuel-level a3 f2)
   added: (at a3 c2) (fuel-level a3 f1)
   goals met: 6 of 21
3. (debark p1 a3 c2)
   deleted: (in p1 a3)
   added: (at p1 c2)
   goals met: 7 of 21
4. (fly a1 c2 c3 f2 f1)
   deleted: (at a1 c2) (fuel-level a1 f2)
   added: (at a1 c3) (fuel-level a1 f1)
   goals met: 6 of 21
5. (board p3 a1 c3)
   deleted: (at p3 c3)
   added: (in p3 a1)
   goals met: 6 of 21
6. (fly a1 c3 c1 f1 f0)
   deleted: (at a1 c3) (fuel-level a1 f1)
   added: (at a1 c1) (fuel-level a1 f0)
   goals met: 6 of 21
7. (debark p3 a1 c1)
   deleted: (in p3 a1)
   added: (at p3 c1)
   goals met: 7 of 21
8. (board p4 a1 c1)
   deleted: (at p4 c1)
   added: (in p4 a1)
   goals met: 7 of 21
9. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 7 of 21
10. (fly a1 c1 c3 f2 f1)
   deleted: (at a1 c1) (fuel-level a1 f2)
   added: (at a1 c3) (fuel-level a1 f1)
   goals met: 7 of 21
11. (debark p4 a1 c3)
   deleted: (in p4 a1)
   added: (at p4 c3)
   goals met: 8 of 21
12. (board p6 a2 c1)
   deleted: (at p6 c1)
   added: (in p6 a2)
   goals met: 8 of 21
13. (fly a2 c1 c2 f2 f1)
   deleted: (at a2 c1) (fuel-level a2 f2)
   added: (at a2 c2) (fuel-level a2 f1)
   goals met: 7 of 21
14. (debark p6 a2 c2)
   deleted: (in p6 a2)
   added: (at p6 c2)
   goals met: 8 of 21
15. (board p7 a1 c3)
   deleted: (at p7 c3)
   added: (in p7 a1)
   goals met: 8 of 21
16. (fly a1 c3 c2 f1 f0)
   deleted: (at a1 c3) (fuel-level a1 f1)
   added: (at a1 c2) (fuel-level a1 f0)
   goals met: 9 of 21
17. (debark p7 a1 c2)
   deleted: (in p7 a1)
   added: (at p7 c2)
   goals met: 10 of 21
18. (fly a2 c2 c1 f1 f0)
   deleted: (at a2 c2) (fuel-level a2 f1)
   added: (at a2 c1) (fuel-level a2 f0)
   goals met: 11 of 21
19. (board p8 a2 c1)
   deleted: (at p8 c1)
   added: (in p8 a2)
   goals met: 11 of 21
20. (refuel a2 f0 f2)
   deleted: (fuel-level a2 f0)
   added: (fuel-level a2 f2)
   goals met: 11 of 21
21. (fly a2 c1 c3 f2 f1)
   deleted: (at a2 c1) (fuel-level a2 f2)
   added: (at a2 c3) (fuel-level a2 f1)
   goals met: 10 of 21
22. (debark p8 a2 c3)
   deleted: (in p8 a2)
   added: (at p8 c3)
   goals met: 11 of 21
23. (fly a2 c3 c1 f1 f0)
   deleted: (at a2 c3) (fuel-level a2 f1)
   added: (at a2 c1) (fuel-level a2 f0)
   goals met: 12 of 21
24. (board p11 a2 c1)
   deleted: (at p11 c1)
   added: (in p11 a2)
   goals met: 12 of 21
25. (refuel a2 f0 f2)
   deleted: (fuel-level a2 f0)
   added: (fuel-level a2 f2)
   goals met: 12 of 21
26. (fly a2 c1 c3 f2 f1)
   deleted: (at a2 c1) (fuel-level a2 f2)
   added: (at a2 c3) (fuel-level a2 f1)
   goals met: 11 of 21
27. (debark p11 a2 c3)
   deleted: (in p11 a2)
   added: (at p11 c3)
   goals met: 12 of 21
28. (board p12 a1 c2)
   deleted: (at p12 c2)
   added: (in p12 a1)
   goals met: 12 of 21
29. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 12 of 21
30. (fly a1 c2 c1 f2 f1)
   deleted: (at a1 c2) (fuel-level a1 f2)
   added: (at a1 c1) (fuel-level a1 f1)
   goals met: 11 of 21
31. (debark p12 a1 c1)
   deleted: (in p12 a1)
   added: (at p12 c1)
   goals met: 12 of 21
32. (board p13 a2 c3)
   deleted: (at p13 c3)
   added: (in p13 a2)
   goals met: 12 of 21
33. (fly a2 c3 c1 f1 f0)
   deleted: (at a2 c3) (fuel-level a2 f1)
   added: (at a2 c1) (fuel-level a2 f0)
   goals met: 13 of 21
34. (debark p13 a2 c1)
   deleted: (in p13 a2)
   added: (at p13 c1)
   goals met: 14 of 21
35. (board p14 a3 c2)
   deleted: (at p14 c2)
   added: (in p14 a3)
   goals met: 14 of 21
36. (fly a3 c2 c1 f1 f0)
   deleted: (at a3 c2) (fuel-level a3 f1)
   added: (at a3 c1) (fuel-level a3 f0)
   goals met: 15 of 21
37. (debark p14 a3 c1)
   deleted: (in p14 a3)
   added: (at p14 c1)
   goals met: 16 of 21
38. (fly a1 c1 c2 f1 f0)
   deleted: (at a1 c1) (fuel-level a1 f1)
   added: (at a1 c2) (fuel-level a1 f0)
   goals met: 17 of 21
39. (board p15 a1 c2)
   deleted: (at p15 c2)
   added: (in p15 a1)
   goals met: 17 of 21
40. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 17 of 21
41. (fly a1 c2 c3 f2 f1)
   deleted: (at a1 c2) (fuel-level a1 f2)
   added: (at a1 c3) (fuel-level a1 f1)
   goals met: 16 of 21
42. (debark p15 a1 c3)
   deleted: (in p15 a1)
   added: (at p15 c3)
   goals met: 17 of 21
43. (board p16 a1 c3)
   deleted: (at p16 c3)
   added: (in p16 a1)
   goals met: 17 of 21
44. (fly a1 c3 c2 f1 f0)
   deleted: (at a1 c3) (fuel-level a1 f1)
   added: (at a1 c2) (fuel-level a1 f0)
   goals met: 18 of 21
45. (debark p16 a1 c2)
   deleted: (in p16 a1)
   added: (at p16 c2)
   goals met: 19 of 21
46. (board p17 a1 c2)
   deleted: (at p17 c2)
   added: (in p17 a1)
   goals met: 19 of 21
47. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 19 of 21
48. (fly a1 c2 c1 f2 f1)
   deleted: (at a1 c2) (fuel-level a1 f2)
   added: (at a1 c1) (fuel-level a1 f1)
   goals met: 18 of 21
49. (debark p17 a1 c1)
   deleted: (in p17 a1)
   added: (at p17 c1)
   goals met: 19 of 21
50. (board p18 a1 c1)
   deleted: (at p18 c1)
   added: (in p18 a1)
   goals met: 19 of 21
51. (fly a1 c1 c2 f1 f0)
   deleted: (at a1 c1) (fuel-level a1 f1)
   added: (at a1 c2) (fuel-level a1 f0)
   goals met: 20 of 21
52. (debark p18 a1 c2)
   deleted: (in p18 a1)
   added: (at p18 c2)
   goals met: 21 of 21
